Revit 2027 API
BuiltInFailures.RebarFailures.RebarHookOverCrank Property
 Cannot add hook to the end that already has a crank.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarHookOverCrank { get; }
Public Shared ReadOnly Property RebarHookOverCrank As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarHookOverCrank {
	FailureDefinitionId^ get ();
}
static member RebarHookOverCrank : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace